src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОнлайнЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОнлайнЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНоменклатурыМедицинскиУслуг</Name>
					<Comment>Код услуги (Приказ МЗ РФ от 13.10.2017г. №804Н)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМедицинскихУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНоменклатурыМедицинскихУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменССайтомСоответствиеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноУказаниеАссистента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписиAPI</Name>
					<Comment>Описание, которое отдаем в API, для выгрузки нам нужно только body, что бы в API не терять из-за обрезки время, добавили доп. реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатМногоразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкиЗапрещены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация для номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаДляОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗапас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИменнойСертификат</Name>
					<Comment>Это именной сертификат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИмущество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПодарочныйСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиЗубнойФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СостояниеЗубнойФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостояниеЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СННоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/УслугиСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УслугиСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Номенклатура/Forms/ФормаСотрудникиПоУслуге/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Номенклатура", Номенклатура);
		
	СоздатьДеревоУслуг();
	УстановитьУсловноеОформление(); 
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УслугиСотрудника) Тогда
		
		Элементы.ГруппаДеревоСотрудников.ТолькоПросмотр = Истина;
		Элементы.ГруппаФильтрКнопки.Доступность	 		= Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьФильтр();
	ПослеЗаполненияСпискаПодбораСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ФильтрПриИзменении(Элемент)
	
	УстановитьФильтр();
	Если Фильтр = 1 Тогда
		ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборСотрудников, Истина);		
		Если ИдТекЭлемент <> Неопределено Тогда
			Элементы._ПодборСотрудников.ТекущаяСтрока = ИдТекЭлемент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура Подключаемый_ПодборСотрудниковПриИзменении(Элемент)
	
	ИмяКолонки 	  = Элемент.Имя;
	ТекущиеДанные = Элементы._ПодборСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда                      		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли; 
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки);
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, Истина);
	Иначе
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли;		
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки);			
	КонецЕсли;
	
	Если Фильтр = 1 Тогда
		ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборСотрудников, Истина);		
		Если ИдТекЭлемент <> Неопределено Тогда
			Элементы._ПодборСотрудников.ТекущаяСтрока = ИдТекЭлемент;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаСотрудников.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборСотрудников.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуСотрудников(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыСотрудников(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	СохранитьЗначения(ТаблицаСотрудников, ЭтотОбъект.Номенклатура);
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура Подключаемый_НормаВремениПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы._ПодборСотрудников.ТекущиеДанные;
	ТекущиеДанные.НормаВремениСотрудника = НЕ ТекущиеДанные.НормаВремени = ТекущиеДанные.БазоваяНормаВремени;
	
	ТаблицаСотрудников.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборСотрудников.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуСотрудников(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыСотрудников(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	СохранитьЗначения(ТаблицаСотрудников, ЭтотОбъект.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередНачаломДобавления".
//
Процедура Подключаемый_ПодборСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередУдалением".
//
Процедура Подключаемый_ПодборСотрудниковПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик события команды.
//
Процедура СкопироватьНастройки(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,,,,,Новый ОписаниеОповещения("СкопироватьНастройкиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения команды.
//
Процедура СкопироватьНастройкиЗавершение(Источник, Параметры) Экспорт
	
	Если Не Источник = Неопределено И Не Источник = Номенклатура Тогда
		СкопироватьНастройкиСотрудника(Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция - Получить места работы сотрудников
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМестаРаботыСотрудников()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
КонецФункции

&НаСервере
// Процедура, выполянет создание дерева услуг.
//
Процедура СоздатьДеревоУслуг()
	
	МассивСтруктурныхЕдиниц = ПолучитьМестаРаботыСотрудников();
 	
	Индекс = 1;
	Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
		НоваяСтрока = МестаРаботы.Добавить();
		НоваяСтрока.НомерСтроки = Индекс;
		НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ИмяЭлементаДляРазмещения = "ГруппаДеревоСотрудников";
	масРеквизитов = Новый Массив;		
	
	ИмяДерева = "_ПодборСотрудников";
	
	МассивДопустимыхТипов = Новый Массив;
	МассивДопустимыхТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	МассивДопустимыхТипов.Добавить(Тип("Строка"));
	
	МассивДопустимыхТиповДолжности = Новый Массив;
	МассивДопустимыхТиповДолжности.Добавить(Тип("СправочникСсылка.Должности"));
	МассивДопустимыхТиповДолжности.Добавить(Тип("Строка"));
		
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ДеревоЗначений"), , "Подбор номенклатур", Ложь));
	масРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник"	      	   , Новый ОписаниеТипов(МассивДопустимыхТипов), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Должность"	      	   , Новый ОписаниеТипов(МассивДопустимыхТиповДолжности), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("БазоваяНормаВремени"   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремениСотрудника", Новый ОписаниеТипов("Булево"), ИмяДерева));
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		масРеквизитов.Добавить(Новый РеквизитФормы("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки, Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	КонецЦикла;
	
	масРеквизитов.Добавить(Новый РеквизитФормы("_ПодборСотрудниковИсточникГрупп", Новый ОписаниеТипов("ДеревоЗначений"), , "Услгуи подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), "_ПодборСотрудниковИсточникГрупп"));
	
	ИмяДерева = "_ПодборСотрудниковИсточникЭлементов";
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ТаблицаЗначений"), , "Услгуи подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник"	       	   , Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Должность"	       	   , Новый ОписаниеТипов("СправочникСсылка.Должности"), ИмяДерева)); 
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Родитель"		       , Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Наименование"	       , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("БазоваяНормаВремени"   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремениСотрудника", Новый ОписаниеТипов("Булево"), ИмяДерева));
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		масРеквизитов.Добавить(Новый РеквизитФормы("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки,  Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	КонецЦикла;
	
	ИзменитьРеквизиты(масРеквизитов);	
	
	ЭлементДерево = Элементы.Добавить("_ПодборСотрудников", Тип("ТаблицаФормы"), Элементы[ИмяЭлементаДляРазмещения]);
	ЭлементДерево.ПутьКДанным 				 = "_ПодборСотрудников";
	ЭлементДерево.Отображение 				 = ОтображениеТаблицы.Дерево;
	ЭлементДерево.КартинкаСтрок 			 = БиблиотекаКартинок.ТерминалПодбор;
	ЭлементДерево.ПутьКДаннымКартинкиСтроки  = "_ПодборСотрудников.ИндКартинки";
	ЭлементДерево.КоманднаяПанель.Видимость  = Ложь;
	ЭлементДерево.КонтекстноеМеню.Видимость  = Ложь;
	ЭлементДерево.ПоложениеКоманднойПанели   = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	//ЭлементДерево.АвтоМаксимальнаяШирина  	 = Ложь;
	//ЭлементДерево.МаксимальнаяШирина 	 	 = 120;
	ЭлементДерево.РастягиватьПоГоризонтали   = Истина;
	ЭлементДерево.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	ЭлементДерево.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ПодборСотрудниковПередНачаломДобавления");
	ЭлементДерево.УстановитьДействие("ПередУдалением", "Подключаемый_ПодборСотрудниковПередУдалением");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Сотрудник", Тип("ПолеФормы"), ЭлементДерево);	
	НовыйЭлемент.Вид 		 			  	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоМаксимальнаяШирина    	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 	 	 = 60;
	НовыйЭлемент.ТолькоПросмотр 		 	 = Истина;
	НовыйЭлемент.ЦветФонаЗаголовка			 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ПутьКДанным 			 	 = "_ПодборСотрудников.Сотрудник";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Должность", Тип("ПолеФормы"), ЭлементДерево);	
	НовыйЭлемент.Вид 		 			  	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоМаксимальнаяШирина    	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 	 	 = 60;
	НовыйЭлемент.ТолькоПросмотр 		 	 = Истина;
	НовыйЭлемент.ЦветФонаЗаголовка			 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ПутьКДанным 			 	 = "_ПодборСотрудников.Должность";

	НовыйЭлемент = Элементы.Добавить("НормаВремени", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид		 			 	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 			 	 = "_ПодборСотрудников.НормаВремени";
	НовыйЭлемент.Ширина 	 			 	 = 12;
	НовыйЭлемент.АвтоМаксимальнаяШирина  	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 	 	 = 12;
	НовыйЭлемент.РастягиватьПоГоризонтали	 = Ложь;	
	НовыйЭлемент.Заголовок 				 	 = "Норма времени";
	НовыйЭлемент.ЦветФонаЗаголовка			 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НормаВремениПриИзменении");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		
		НовыйЭлемент = Элементы.Добавить("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки, Тип("ПолеФормы"), ЭлементДерево);
		НовыйЭлемент.Вид					 = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным			 = "_ПодборСотрудников.СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки;
		НовыйЭлемент.Заголовок				 = СтрокаТЧ.СтруктурнаяЕдиница.Наименование;		
		НовыйЭлемент.ТриСостояния 			 = Истина;
		НовыйЭлемент.ЦветФонаЗаголовка		 = Новый Цвет(255, 255, 255);
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодборСотрудниковПриИзменении");
		
	КонецЦикла;	
	
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодборСотрудниковПриИзменении");

	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновитьДеревоПодборовСотрудников();		
	
	// Проставялем флаги на группах дерева.
	УстановитьНачальныеФлагиНаГруппы();
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет установку условного оформления.
//
Процедура УстановитьУсловноеОформление()
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора		   = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Для Каждого МестоРаботы Из МестаРаботы Цикл
		
		ЭлементОтбора				 = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборСотрудников.СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки); // имя поля
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = 0;                                              
		ЭлементОтбора.Использование  = Истина;
		
	КонецЦикла;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Видимость"), Ложь);
	
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Сотрудник");
	ПолеОформления.Использование = Истина;  
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("Должность");
	ПолеОформления.Использование = Истина; 
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина;
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();	
		ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки);
		ПолеОформления.Использование = Истина;		
	КонецЦикла;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Доступность"), Ложь);
	
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина; 
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора				 = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборСотрудников.ЭтоГруппа"); // имя поля	
	ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветФона"), Новый Цвет(245, 245, 245));
	
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("_ПодборСотрудников");
	ПолеОформления.Использование = Истина; 
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора				 = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборСотрудников.НормаВремениСотрудника"); // имя поля
	ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), WebЦвета.Зеленый);
	
	ПолеОформления				 = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле			 = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина;	
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение подбора номенклатуры 
//
Процедура ЗаполнитьДеревоПодбораСотрудников()
		
	ЭтаФорма._ПодборСотрудниковИсточникГрупп.ПолучитьЭлементы().Очистить();
	ЭтаФорма._ПодборСотрудниковИсточникЭлементов.Очистить();
	ЭтаФорма._ПодборСотрудников.ПолучитьЭлементы().Очистить();

	ЗапросГрупп = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ИСТИНА
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ,
	|	Сотрудники.Наименование");	
	
	ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	ЭтаФорма._ПодборСотрудниковИсточникГрупп.ПолучитьЭлементы().Очистить();	
	
	ЗаполнитьИсточникГрупп(ВыборкаГрупп, ЭтаФорма._ПодборСотрудниковИсточникГрупп.ПолучитьЭлементы());	
	ПустаяГруппа = ЭтаФорма._ПодборСотрудниковИсточникГрупп.ПолучитьЭлементы().Добавить();
	
	ЗапросСотрудников = Новый Запрос( 
	"ВЫБРАТЬ
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.НормаВремени КАК НормаВремениСотрудника,
	|	Номенклатуры.НормаВремени КАК НормаВремени,
	|	Номенклатуры.НормаВремени КАК БазоваяНормаВремени
	|ПОМЕСТИТЬ УслугиСотрудника
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатуры
	|		ПО УслугиСотрудника.Номенклатура = Номенклатуры.Ссылка
	|ГДЕ
	|	УслугиСотрудника.Номенклатура = &Номенклатура
	|	И УслугиСотрудника.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрСотрудники.Ссылка КАК Сотрудник,
	|	СпрСотрудники.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА СпрСотрудники.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СпрСотрудники.Родитель КАК Родитель,
	|	СпрСотрудники.Наименование КАК Наименование,
	|	УслугиСотрудника.НормаВремениСотрудника КАК НормаВремениСотрудника,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СпрСотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК СпрСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиСотрудника КАК УслугиСотрудника
	|		ПО СпрСотрудники.Ссылка = УслугиСотрудника.Сотрудник
	|ГДЕ
	|	НЕ СпрСотрудники.ПометкаУдаления
	|	И НЕ СпрСотрудники.ЭтоГруппа
    |   И СпрСотрудники.Служебный = ЛОЖЬ
	|   И &ОтборПоСотруднику
	|   И &ОтборПоДолжности
	|   И &ОтборПоРоли
	|УПОРЯДОЧИТЬ ПО
	|	Должность,
	|	Наименование
	|ИТОГИ
	|	МАКСИМУМ(ЭтоГруппа),
	|	МАКСИМУМ(ИндКартинки),
	|	МАКСИМУМ(Родитель),
	|	МАКСИМУМ(Наименование)
	|ПО
	|	Сотрудник");
	
	ЗапросСотрудников.УстановитьПараметр("Номенклатура"			  , ЭтотОбъект.Номенклатура);
	ЗапросСотрудников.УстановитьПараметр("МассивСтруктурныхЕдиниц", МестаРаботы.Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	
	Если ЗначениеЗаполнено(ОтборСотрудник) И ТипЗнч(ОтборСотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоСотруднику","И СпрСотрудники.Ссылка = &Сотрудник"); 
		ЗапросСотрудников.УстановитьПараметр("Сотрудник",ОтборСотрудник);
	Иначе
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоСотруднику",""); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборСотрудникДолжность) И ТипЗнч(ОтборСотрудникДолжность) = Тип("СправочникСсылка.Должности") Тогда
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоДолжности","И СпрСотрудники.Должность = &Должность"); 
		ЗапросСотрудников.УстановитьПараметр("Должность",ОтборСотрудникДолжность);
	Иначе
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоДолжности",""); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборСотрудникРоль) И ТипЗнч(ОтборСотрудникРоль) = Тип("ПеречислениеСсылка.РольПользователя") Тогда
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоРоли","И СпрСотрудники.Роль = &Роль"); 
		ЗапросСотрудников.УстановитьПараметр("Роль",ОтборСотрудникРоль);
	Иначе
		ЗапросСотрудников.Текст = СтрЗаменить(ЗапросСотрудников.Текст,"И &ОтборПоРоли",""); 
	КонецЕсли;

	ВыборкаСотрудников = ЗапросСотрудников.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	НомераСтруктурныхЕдиниц = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из МестаРаботы Цикл
		НомераСтруктурныхЕдиниц.Вставить(СтрокаТЧ.СтруктурнаяЕдиница, СтрокаТЧ.НомерСтроки);
	КонецЦикла;
	
	Пока ВыборкаСотрудников.Следующий() Цикл
		
		СтрокаТЧ = ЭтаФорма._ПодборСотрудниковИсточникЭлементов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаСотрудников);
		СтрокаТЧ.НормаВремени = ?(СтрокаТЧ.НормаВремени = 0, ЭтотОбъект.Номенклатура.НормаВремени, СтрокаТЧ.НормаВремени);
		
		ВыборкаЗначений = ВыборкаСотрудников.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		
		Пока ВыборкаЗначений.Следующий() Цикл 
			Если ЗначениеЗаполнено(ВыборкаЗначений.СтруктурнаяЕдиница) Тогда
				СтрокаТЧ["СтруктурнаяЕдиница" + НомераСтруктурныхЕдиниц[ВыборкаЗначений.СтруктурнаяЕдиница]] = Истина;
				Если ЗначениеЗаполнено(ВыборкаЗначений.НормаВремениСотрудника) Тогда
					СтрокаТЧ.НормаВремени = ВыборкаЗначений.НормаВремениСотрудника;
					Если Не СтрокаТЧ.БазоваяНормаВремени = СтрокаТЧ.НормаВремени Тогда
						СтрокаТЧ.НормаВремениСотрудника = Истина;
					КонецЕсли; 				
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура, заполняет источник групп
//
Процедура ЗаполнитьИсточникГрупп(ВыборкаГрупп,УровеньЗаполнения)
	
	Для Каждого УровеньОбхода ИЗ ВыборкаГрупп.Строки Цикл
		НоваяСтрока = УровеньЗаполнения.Добавить();
		ЗаполнитьИсточникГрупп(УровеньОбхода,НоваяСтрока.ПолучитьЭлементы());
		НоваяСтрока.Сотрудник = УровеньОбхода.Ссылка;                          
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура рекурсивного заолнения дерева подбора номенклатур
//
Процедура ЗаполнитьСписокПодбораРекурсивноСервер(ИсточникГрупп, ИсточникСотрудников, ЭлементЗаполнения, Форма)
		
	Для Каждого УровеньЗаполнения ИЗ ИсточникГрупп Цикл
		Если ЗначениеЗаполнено(УровеньЗаполнения.Сотрудник) Тогда
			НоваяСтрокаГруппы           = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
			НоваяСтрокаГруппы.Сотрудник = УровеньЗаполнения.Сотрудник;
			НоваяСтрокаГруппы.ЭтоГруппа = Истина;
		Иначе
			НоваяСтрокаГруппы = Форма._ПодборСотрудников;
		КонецЕсли;
		
		ЗаполнитьСписокПодбораРекурсивноСервер(УровеньЗаполнения.ПолучитьЭлементы(), ИсточникСотрудников, НоваяСтрокаГруппы, Форма);						
		СотрудникПоРодителю = Форма._ПодборСотрудниковИсточникЭлементов.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Сотрудник));	
		
		// Заполняем номенклатуры
		Для Каждого СтрокаН ИЗ СотрудникПоРодителю Цикл
			НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаН);
		КонецЦикла;
		
		// Удаляем узел группы если он не содержит элементы
		Если НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 И Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДанныеФормыДерево") Тогда
			ЭлементЗаполнения.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура рекурсивного заолнения дерева подбора номенклатур
//
Процедура ЗаполнитьСписокПодбораРекурсивно(ИсточникГрупп, ИсточникСотрудников, ЭлементЗаполнения, Форма)
	
	Для Каждого УровеньЗаполнения ИЗ ИсточникГрупп Цикл
		
		Если ЗначениеЗаполнено(УровеньЗаполнения.Номенклатура) Тогда
			НоваяСтрокаГруппы              = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
			НоваяСтрокаГруппы.Номенклатура = УровеньЗаполнения.Номенклатура;		
			НоваяСтрокаГруппы.ЭтоГруппа    = Истина;
		Иначе
			НоваяСтрокаГруппы = ЭтаФорма._ПодборСотрудников;
		КонецЕсли;
		
		ЗаполнитьСписокПодбораРекурсивно(УровеньЗаполнения.ПолучитьЭлементы(), ИсточникСотрудников,НоваяСтрокаГруппы, Форма);			
		СотрудникПоРодителю = ЭтаФорма._ПодборСотрудниковИсточникЭлементов.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Номенклатура));
		
		// Заполняем номенклатуры
		Для Каждого СтрокаН ИЗ СотрудникПоРодителю Цикл
			НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаН);
		КонецЦикла;
		
		// Удаляем узел группы если он не содержит элементы
		Если НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 И Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДанныеФормыДерево") Тогда
			ЭлементЗаполнения.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Выполняется после заполнения дерева подобра. Разворачивается дерево, установка тек. элемента
//
Процедура ПослеЗаполненияСпискаПодбораСотрудников()
	
	ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы._ПодборСотрудников, ЭтаФорма._ПодборСотрудников);
	
	ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборСотрудников);
	
	Если ИдТекЭлемент <> Неопределено Тогда
		Элементы._ПодборСотрудников.ТекущаяСтрока = ИдТекЭлемент;
	КонецЕсли;
	
	Для Каждого ПунктКонтекстногоМеню Из Элементы._ПодборСотрудников.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
		ПунктКонтекстногоМеню.Видимость=Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Функция вернет идентификатор строки элемента или группы
//
Функция ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ТаблицаПодбора, ВернутьГруппу = Ложь)
	
	ВерхнийУровень = ТаблицаПодбора.ПолучитьЭлементы();
	Для Каждого ЭлементУровня ИЗ ВерхнийУровень Цикл 		
		Для НомерСЕ = 1 По МестаРаботы.Количество() Цикл 
			Если ЭлементУровня.ЭтоГруппа И ЭлементУровня["СтруктурнаяЕдиница" + НомерСЕ] Тогда
				Если ВернутьГруппу Тогда
					Возврат ЭлементУровня.ПолучитьИдентификатор();
				Иначе
					Рез = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭлементУровня); 
					Если Рез <> Неопределено Тогда
						Возврат Рез;
					КонецЕсли;				
				КонецЕсли;
			ИначеЕсли ЭлементУровня["СтруктурнаяЕдиница" + НомерСЕ] Тогда
				Возврат ЭлементУровня.ПолучитьИдентификатор();
			КонецЕсли;		
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено; 
	
КонецФункции

&НаСервере
// Процедура, устанавливает флаги на группы при первоночальном построение дерева.
//
Процедура УстановитьНачальныеФлагиНаГруппы()
	
	// Проставялем флаги на группах дерева.
	ДанныеДерева = ЭтаФорма._ПодборСотрудников.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Для Каждого МестоРаботы Из ЭтотОбъект.МестаРаботы Цикл
			Если СтрокаТЧ.ЭтоГруппа Тогда
				ОбработкаТабличныхЧастейКлиент.УстановитьНачальныеФлагиНаГруппы(СтрокаТЧ, "СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет установку флагов на элменеты.
//
Процедура УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки)
	
	Флаг =  ТекущиеДанные[ИмяКолонки];
	ДанныеДерева = ТекущиеДанные.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		Если Фильтр = 1 Тогда
			Видимость = Ложь;
			Для НомерСЕ = 1 по МестаРаботы.Количество() Цикл
				Если СтрокаДерева["СтруктурнаяЕдиница" + НомерСЕ] Тогда
					Видимость = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Видимость = Истина;
		КонецЕсли;
		
		Если Видимость Тогда
			СтрокаДерева[ИмяКолонки] = Флаг;
		КонецЕсли;
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановитьФлагиНаЭлементы(СтрокаДерева, ИмяКолонки);
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает флаги на группы.
//
Процедура УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, ЭтоРодитель = Ложь)
	
	Если ЭтоРодитель Тогда
		Родитель = ТекущиеДанные;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		Если СтрокаДерева[ИмяКолонки] = 1 Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		ИначеЕсли СтрокаДерева[ИмяКолонки] = 2 Тогда
			КоличествоВыбранных = -1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонки] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонки] = 0;
	Иначе
		Родитель[ИмяКолонки] = 2;
	КонецЕсли;		
	
	УстановитьФлагиНаГруппы(Родитель, ИмяКолонки);
	
КонецПроцедуры

&НаСервере
// Процедура, устанвливает фильтр.
//
Процедура УстановитьФильтр()
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы[0];
	Если Фильтр = 1 Тогда
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Истина;
	Иначе
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, выполянет сохранение значений в регистр сведений.
//
Процедура СохранитьЗначения(Знач ТаблицаСотрудников, Номенклатура)
	
	НаборЗаписей = РегистрыСведений.УслугиСотрудника.СоздатьНаборЗаписей();
	Таблица = ДанныеФормыВЗначение(ТаблицаСотрудников, Тип("ТаблицаЗначений"));
	НаборЗаписей.Загрузить(Таблица);
	НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
	НаборЗаписей.Отбор.Номенклатура.Значение	  = Номенклатура;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение таблицы сотрудников.
//
Процедура ЗаполнитьТаблицуСотрудников(Родитель) 
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();	
	
	Для Каждого СтрокаДерева Из ДанныеДерева Цикл		
		Если СтрокаДерева.ЭтоГруппа Тогда
			ЗаполнитьТаблицуСотрудников(СтрокаДерева);
		Иначе
			ЗаполнитьСтрокуТаблицыСотрудников(СтрокаДерева);	
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение строки таблицы.
//
Процедура ЗаполнитьСтрокуТаблицыСотрудников(СтрокаДерева)
	
	Для Каждого МестоРаботы Из МестаРаботы Цикл
		
		Если СтрокаДерева["СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки] Тогда
			НоваяСтрока                    = ТаблицаСотрудников.Добавить();
			НоваяСтрока.Номенклатура       = ЭтотОбъект.Номенклатура;
			НоваяСтрока.СтруктурнаяЕдиница = МестоРаботы.СтруктурнаяЕдиница;
			НоваяСтрока.Сотрудник      	   = СтрокаДерева.Сотрудник;
			НоваяСтрока.НормаВремени       = СтрокаДерева.НормаВремени;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, выполянет копирование настроек сотрудника.
//
Процедура СкопироватьНастройкиСотрудника(Источник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|ГДЕ
	|	УслугиСотрудника.Номенклатура = &Источник
	|	И УслугиСотрудника.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)");
	
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МестаРаботы.Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	Запрос.УстановитьПараметр("Источник" 			   , Источник);
	Запрос.УстановитьПараметр("Номенклатура"		   , Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.УслугиСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Результат);
	НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
	НаборЗаписей.Отбор.Номенклатура.Значение 	  = Номенклатура;
	НаборЗаписей.Записать(Истина);
	
	ОтборСотрудник 			= Справочники.Сотрудники.ПустаяСсылка();
	ОтборСотрудникДолжность = Справочники.Должности.ПустаяСсылка();
	ОтборСотрудникРоль      = Перечисления.РольПользователя.ПустаяСсылка();
	
	ОбновитьДеревоПодборовСотрудников(Истина,Истина,Истина);
	
	// Проставялем флаги на группах дерева.
	УстановитьНачальныеФлагиНаГруппы();
	
КонецПроцедуры

&НаКлиенте
// Процедура, выбрать все строки.
//
Процедура ВыбратьСтроки(Команда)
	
	Установить = 1;
	ОтметитьCотрудников(Установить);
	
КонецПроцедуры

&НаКлиенте
// Процедура, исключить все строки.
//
Процедура ИсключитьСтроки(Команда)
	
	Установить = 0;
	ОтметитьCотрудников(Установить);
	
КонецПроцедуры

&НаКлиенте
// Процедура, отмечает сотрудников.
//
Процедура ОтметитьCотрудников(Установить)
	
	ТаблицаСотрудников.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборСотрудников.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			Для Каждого МестоРаботы Из МестаРаботы Цикл
				СтрокаТЧ["СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки] = Установить;
			КонецЦикла;
			ЗаполнитьВсеТаблицыСотрудников(СтрокаТЧ, Установить);
		Иначе
			ЗаполнитьВсеСтрокиТаблицыСотрудников(СтрокаТЧ, Установить);
		КонецЕсли;
	КонецЦикла;
	СохранитьЗначения(ТаблицаСотрудников, ЭтотОбъект.Номенклатура);
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение всех строк таблицы.
//
Процедура ЗаполнитьВсеСтрокиТаблицыСотрудников(СтрокаДерева, Установить)
	
	Для Каждого МестоРаботы Из МестаРаботы Цикл
		
		СтрокаДерева["СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки] = Установить;
		НоваяСтрока                    = ТаблицаСотрудников.Добавить();
		НоваяСтрока.Номенклатура       = ЭтотОбъект.Номенклатура;
		НоваяСтрока.СтруктурнаяЕдиница = МестоРаботы.СтруктурнаяЕдиница;
		НоваяСтрока.Сотрудник      	   = СтрокаДерева.Сотрудник;
		НоваяСтрока.НормаВремени       = СтрокаДерева.НормаВремени;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение всех таблицы сотрудников.
//
Процедура ЗаполнитьВсеТаблицыСотрудников(Родитель, Установить) 
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();	
	
	Для Каждого СтрокаДерева Из ДанныеДерева Цикл		
		Если СтрокаДерева.ЭтоГруппа Тогда
			Для Каждого МестоРаботы Из МестаРаботы Цикл
				СтрокаДерева["СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки] = Установить;
			КонецЦикла;
			ЗаполнитьВсеТаблицыСотрудников(СтрокаДерева, Установить);
		Иначе
			ЗаполнитьВсеСтрокиТаблицыСотрудников(СтрокаДерева, Установить);	
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить дерево подборов сотрудников
//
// Параметры:
//  ОбновитьОтборПоСотруднику	 - 	 - 
//  ОбновитьОтборПоДолжности	 - 	 - 
//  ОбновитьОтборПоРоли			 - 	 - 
//
Процедура ОбновитьДеревоПодборовСотрудников(ОбновитьОтборПоСотруднику = Ложь, ОбновитьОтборПоДолжности = Ложь, ОбновитьОтборПоРоли = Ложь)
	
	ЗаполнитьДеревоПодбораСотрудников();
	
	ЗаполнитьСписокПодбораРекурсивноСервер(
	ЭтаФорма._ПодборСотрудниковИсточникГрупп.ПолучитьЭлементы(), 
	ЭтаФорма._ПодборСотрудниковИсточникЭлементов, 
	ЭтаФорма._ПодборСотрудников, ЭтаФорма);	
	
	Если ОбновитьОтборПоСотруднику Тогда
		Элементы.ОткрытьСписокСотрудники.Заголовок 	= ?(ЗначениеЗаполнено(ОтборСотрудник), ОтборСотрудник.Наименование, "Все");	
		Элементы.ОтменитьОтборПоСотруднику.Видимость = Элементы.ОткрытьСписокСотрудники.Заголовок <> "Все";
	КонецЕсли;
	
	Если ОбновитьОтборПоДолжности Тогда
		Элементы.ОткрытьСписокДолжности.Заголовок 	= ?(ЗначениеЗаполнено(ОтборСотрудникДолжность), ОтборСотрудникДолжность.Наименование, "Все");
		Элементы.ОтменитьОтборПоДолжности.Видимость = Элементы.ОткрытьСписокДолжности.Заголовок <> "Все";
	КонецЕсли;
	
	Если ОбновитьОтборПоРоли Тогда
		Элементы.ОткрытьСписокРоли.Заголовок 	= ?(ЗначениеЗаполнено(ОтборСотрудникРоль), Строка(ОтборСотрудникРоль), "Все");
		Элементы.ОтменитьОтборПоРоли.Видимость 	= Элементы.ОткрытьСписокРоли.Заголовок <> "Все";
	КонецЕсли;
	
КонецПроцедуры

#Область Отборы

#Область ПоСотруднику

&НаКлиенте
// Процедура - Открыть список сотрудников.
// 
// 
Процедура ОткрытьСписокСотрудников(Команда)
	
	СписокСотрудниковПоОтборамКэш = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудник, СписокСотрудниковПоОтборамКэш);
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокСотрудниковЗавершение",ЭтотОбъект);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("СписокВыбораСотрудников", СписокСотрудниковПоОтборамКэш);
	ПараметрыВыбора.Вставить("БезОтбораПоРолям"		  , Истина);

  	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", ПараметрыВыбора,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокСотрудниковЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудник = Результат;
    
	ОбновитьДеревоПодборовСотрудников(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоСотруднику(Команда)
	
	ОтборСотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	ОбновитьДеревоПодборовСотрудников(Истина);	

КонецПроцедуры

#КонецОбласти

#Область ПоДолжности

&НаКлиенте
// Процедура - Открыть список должностей.
// 
// 
Процедура ОткрытьСписокДолжностей(Команда)
	
	ВременныйСписокСотрудников = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудникДолжность, ВременныйСписокСотрудников);	
	
	СписокЗначений = ПолучитьСписокДолжностей(ВременныйСписокСотрудников);
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокДолжностейЗавершение", ЭтотОбъект);
	
	Если СписокЗначений.Количество() > 20 Тогда	
		ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе			
		ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклДолжность);	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокДолжностейЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудникДолжность = Результат.Значение;
	ОбновитьДеревоПодборовСотрудников(,Истина);
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоДолжности(Команда)
	
	ОтборСотрудникДолжность = ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");	
	ОбновитьДеревоПодборовСотрудников(,Истина);
		
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция - Получить список сотрудников.
// 
// 
Функция ПолучитьСписокДолжностей(ВременныйСписокСотрудников = Неопределено)
	
	ТаблицаДолжностей = ПолучитьТаблицуДолжностей(ВременныйСписокСотрудников);
	ТаблицаДолжностей.Сортировать("КоличествоСотрудников Убыв",);
	СписокДолжностей = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	Отступ = "    ";
	СписокДолжностей.Добавить("Все", "Все",,БиблиотекаКартинок.ПапкаНовая);	// Все.
	
	Для Каждого СтрокаДолжность Из ТаблицаДолжностей Цикл
		
		Если СтрокаДолжность.КоличествоСотрудников > 0 Тогда
			СписокДолжностей.Добавить(
			СтрокаДолжность.Должность,
			Отступ+Строка(СтрокаДолжность.Должность) + "(" + Строка(СтрокаДолжность.КоличествоСотрудников) + ")",,
			БиблиотекаКартинок.РеквизитКартинка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДолжностей;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьТаблицуДолжностей(ВременныйСписокСотрудников = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК КоличествоСотрудников,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&СписокСотрудников)
	|   И Сотрудники.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Должность";
	
	Если Не ЗначениеЗаполнено(ВременныйСписокСотрудников) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Ссылка В (&СписокСотрудников)", "Истина");	
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", ВременныйСписокСотрудников);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

#КонецОбласти

#Область ПоРоли

&НаКлиенте
// Процедура - Открыть список ролей.
// 
// 
Процедура ОткрытьСписокРолей(Команда)
	
	ВременныйСписокСотрудников = Неопределено;
	
	ЗаполнитьСорудниковСогласноОтборов(ОтборСотрудникРоль, ВременныйСписокСотрудников);
	
	СписокЗначений = ПолучитьСписокРолей(ВременныйСписокСотрудников);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокРолейЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклРоль);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список заверщение Клиент.
// 
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
// 
Процедура ОткрытьСписокРолейЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСотрудникРоль = Результат.Значение;
	ОбновитьДеревоПодборовСотрудников(,,Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отменить отбор по сотруднику.
// 
// 
Процедура ОтменитьОтборПоРоли(Команда)
	
	ОтборСотрудникРоль = ПредопределенноеЗначение("Перечисление.РольПользователя.ПустаяСсылка"); 	
	ОбновитьДеревоПодборовСотрудников(,,Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить список сотрудников.
// 
// 
Функция ПолучитьСписокРолей(ВременныйСписокСотрудников = Неопределено)
	
	ТаблицаРолей = ПолучитьТаблицуРолей(ВременныйСписокСотрудников);
	ТаблицаРолей.Сортировать("КоличествоСотрудников Убыв",);
	СписокРолей = Новый СписокЗначений;
	
	// Заполнение списка сотрудников.
	Отступ = "    ";
	СписокРолей.Добавить("Все", "Все",,БиблиотекаКартинок.ПапкаНовая);	// Все.
	
	Для Каждого СтрокаРоль Из ТаблицаРолей Цикл
		
		Если СтрокаРоль.КоличествоСотрудников > 0 Тогда
			СписокРолей.Добавить(
			СтрокаРоль.Роль,
			Отступ+Строка(СтрокаРоль.Роль) + "(" + Строка(СтрокаРоль.КоличествоСотрудников) + ")",,
			БиблиотекаКартинок.РеквизитКартинка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокРолей;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьТаблицуРолей(ВременныйСписокСотрудников = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сотрудники.Ссылка) КАК КоличествоСотрудников,
	|	Сотрудники.Роль КАК Роль
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&СписокСотрудников)
	|	И Сотрудники.Роль <> ЗНАЧЕНИЕ(Перечисление.РольПользователя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Роль";
	
	Если Не ЗначениеЗаполнено(ВременныйСписокСотрудников) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сотрудники.Ссылка В (&СписокСотрудников)", "Истина");	
	Иначе
		Запрос.УстановитьПараметр("СписокСотрудников", ВременныйСписокСотрудников);	
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти 

&НаСервере
// Функция - Получить таблицу сотрудников.
// 
// Параметры:
//  ДатаВремяНачала						 - 	 -
//  ДатаВремяОкончания					 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Процедура ЗаполнитьСорудниковСогласноОтборов(ИсключаемыйОтбор = Неопределено, ВременныйСписокСотрудников = Неопределено)

	#Область СтарыйЗапро
	//ЗАпрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Сотрудники.Ссылка КАК Сотрудник
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	//|		ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ВЫРАЗИТЬ(НастройкиПользователей.Пользователь КАК Справочник.Сотрудники) КАК Пользователь,
	//|			МАКСИМУМ(ВЫБОР
	//|					КОГДА НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаПриема)
	//|						ТОГДА НастройкиПользователей.Значение
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ) КАК ДатаПриема,
	//|			МАКСИМУМ(ВЫБОР
	//|					КОГДА НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения)
	//|						ТОГДА НастройкиПользователей.Значение
	//|					ИНАЧЕ NULL
	//|				КОНЕЦ) КАК ДатаУвольнения
	//|		ИЗ
	//|			РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	//|		ГДЕ
	//|       НастройкиПользователей.Пользователь ССЫЛКА Справочник.Сотрудники
	//|			И (НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаПриема)
	//|					ИЛИ НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ДатаУвольнения))
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			НастройкиПользователей.Пользователь) КАК ДатыПриемаНаРаботу
	//|		ПО Сотрудники.Ссылка = ДатыПриемаНаРаботу.Пользователь
	//|ГДЕ
	//|	НЕ Сотрудники.ЭтоГруппа
	//|	И НЕ Сотрудники.ПометкаУдаления
	//|	И Сотрудники.Должность = &Должность
	//|	И Сотрудники.Роль = &Роль
	//|	И Сотрудники.Ссылка В ИЕРАРХИИ (&Сотрудник)";          	
	#КонецОбласти
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.НормаВремени КАК НормаВремениСотрудника,
	|	Номенклатуры.НормаВремени КАК НормаВремени,
	|	Номенклатуры.НормаВремени КАК БазоваяНормаВремени
	|ПОМЕСТИТЬ УслугиСотрудника
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатуры
	|		ПО УслугиСотрудника.Номенклатура = Номенклатуры.Ссылка
	|ГДЕ
	|	УслугиСотрудника.Номенклатура = &Номенклатура
	|	И УслугиСотрудника.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрСотрудники.Ссылка КАК Сотрудник,
	|	СпрСотрудники.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА СпрСотрудники.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СпрСотрудники.Родитель КАК Родитель,
	|	СпрСотрудники.Наименование КАК Наименование,
	|	УслугиСотрудника.НормаВремениСотрудника КАК НормаВремениСотрудника,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СпрСотрудники.Должность КАК Должность,
	|	СпрСотрудники.Роль КАК Роль
	|ИЗ
	|	Справочник.Сотрудники КАК СпрСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиСотрудника КАК УслугиСотрудника
	|		ПО СпрСотрудники.Ссылка = УслугиСотрудника.Сотрудник
	|ГДЕ
	|	НЕ СпрСотрудники.ПометкаУдаления
	|	И НЕ СпрСотрудники.ЭтоГруппа
	|   И СпрСотрудники.Служебный = ЛОЖЬ
	|	И &ОтборПоДолжности
	|	И &ОтборПоРоли
	|   И &ОтборПоСотруднику
	|УПОРЯДОЧИТЬ ПО
	|	Должность,
	|	Наименование");
	
	Запрос.УстановитьПараметр("Номенклатура"			  , ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МестаРаботы.Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	
	Если ЗначениеЗаполнено(ОтборСотрудник) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоСотруднику","И СпрСотрудники.Ссылка = &Сотрудник"); 
		Запрос.УстановитьПараметр("Сотрудник",ОтборСотрудник);  
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоСотруднику","");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборСотрудникДолжность) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоДолжности","И СпрСотрудники.Должность = &Должность"); 
		Запрос.УстановитьПараметр("Должность",ОтборСотрудникДолжность); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоДолжности","");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборСотрудникРоль) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоРоли","И СпрСотрудники.Роль = &Роль"); 
		Запрос.УстановитьПараметр("Роль",ОтборСотрудникРоль);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &ОтборПоРоли",""); 
	КонецЕсли;
		
	
	ВременныйСписокСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти
